<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
<meta name="theme-color" content="#222">
<meta name="generator" content="Hexo 5.4.2">
  <link rel="apple-touch-icon" sizes="180x180" href="/images/orange.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/images/orange.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/images/orange.png">
  <link rel="mask-icon" href="/images/logo.svg" color="#222">

<link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/lib/font-awesome/css/all.min.css">

<script id="hexo-configurations">
    var NexT = window.NexT || {};

<h3 id="普通类对象的布局"><a href="#普通类对象的布局" class="headerlink" title="普通类对象的布局"></a><strong>普通类对象的布局</strong></h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">struct Base &#123;
   Base() &#x3D; default;
   ~Base() &#x3D; default;
   
   void Func() &#123;&#125;

   int a;
   int b;
&#125;;

int main() &#123;
   Base a;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>输出如下</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">*** Dumping AST Record Layout
        0 | struct Base
        0 |   int a
        4 |   int b
          | [sizeof&#x3D;8, dsize&#x3D;8, align&#x3D;4,
          |  nvsize&#x3D;8, nvalign&#x3D;4]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<p><img src="http://qiniu.orangew.cn/img/20220710171205.png" alt="20220710171205"></p>
<ul>
<li>从结果中可以看见，这个普通结构体Base的大小为8字节，a占4个字节，b占4个字节。</li>
</ul>
<h3 id="带虚函数的类的对象布局"><a href="#带虚函数的类的对象布局" class="headerlink" title="带虚函数的类的对象布局"></a>带虚函数的类的对象布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
struct Base &#123;
   Base() &#x3D; default;
   virtual ~Base() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

int main() &#123;
   Base a;
   return 0;
&#125;

&#x2F;&#x2F; 这里可以查看对象的布局和相应虚函数表的布局
clang -Xclang -fdump-record-layouts -stdlib&#x3D;libc++ -c model.cc
clang -Xclang -fdump-vtable-layouts -stdlib&#x3D;libc++ -c model.cc<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局如下</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">*** Dumping AST Record Layout
        0 | struct Base
        0 |   (Base vtable pointer)
        8 |   int a
       12 |   int b
          | [sizeof&#x3D;16, dsize&#x3D;16, align&#x3D;8,
          |  nvsize&#x3D;16, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>这个含有虚函数的结构体大小为16，在对象的头部，前8个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a占4个字节，b占4个字节，总大小为16。</li>
<li>虚函数表布局：</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">Vtable for &#39;Base&#39; (5 entries).
  0 | offset_to_top (0)
  1 | Base RTTI
      -- (Base, 0) vtable address --
  2 | Base::~Base() [complete]
  3 | Base::~Base() [deleting]
  4 | void Base::FuncB()<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局图</li>
<li><img src="http://qiniu.orangew.cn/img/%E5%AF%B9%E8%B1%A1%E5%B8%83%E5%B1%80%E5%9B%BE.jpg" alt="对象布局图"></li>
<li>我们来探秘下传说中的虚函数表：</li>
<li>**offset_to_top(0)**：表示当前这个虚函数表地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为0。</li>
<li><strong>RTTI指针</strong>：指向存储运行时类型信息(type_info)的地址，用于运行时类型识别，用于typeid和dynamic_cast。</li>
<li>RTTI下面就是虚函数表指针真正指向的地址啦，存储了类里面所有的虚函数，至于这里为什么会有两个析构函数，大家可以先关注对象的布局，最下面会介绍。</li>
</ul>
<h3 id="单继承下不含有覆盖函数的类对象的布局"><a href="#单继承下不含有覆盖函数的类对象的布局" class="headerlink" title="单继承下不含有覆盖函数的类对象的布局"></a>单继承下不含有覆盖函数的类对象的布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
struct Base &#123;
   Base() &#x3D; default;
   virtual ~Base() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;Base FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : public Base&#123;
&#125;;

int main() &#123;
   Base a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>子类对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   struct Base (primary base)
        0 |     (Base vtable pointer)
        8 |     int a
       12 |     int b
          | [sizeof&#x3D;16, dsize&#x3D;16, align&#x3D;8,
          |  nvsize&#x3D;16, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>和上面相同，这个含有虚函数的结构体大小为16，在对象的头部，前8个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a占4个字节，b占4个字节，总大小为16。</li>
<li>子类虚函数表布局：</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">Vtable for &#39;Derive&#39; (5 entries).
  0 | offset_to_top (0)
  1 | Derive RTTI
      -- (Base, 0) vtable address --
      -- (Derive, 0) vtable address --
  2 | Derive::~Derive() [complete]
  3 | Derive::~Derive() [deleting]
  4 | void Base::FuncB()<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>图</li>
<li><img src="http://qiniu.orangew.cn/img/%E5%AD%90%E7%B1%BB%E8%99%9A%E5%87%BD%E6%95%B0%E8%A1%A8%E5%B8%83%E5%B1%80.jpg" alt="子类虚函数表布局"></li>
<li>这个和上面也是相同的，注意下虚函数表这里的FuncB函数，还是Base类中的FuncB，因为在子类中没有重写这个函数，那么如果子类重写这个函数后对象布局是什么样的，请继续往下看哈。</li>
</ul>
<h3 id="单继承下含有覆盖函数的类对象的布局"><a href="#单继承下含有覆盖函数的类对象的布局" class="headerlink" title="单继承下含有覆盖函数的类对象的布局"></a>单继承下含有覆盖函数的类对象的布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
struct Base &#123;
   Base() &#x3D; default;
   virtual ~Base() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;Base FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : public Base&#123;
   void FuncB() override &#123;
       printf(&quot;Derive FuncB \n&quot;);
  &#125;
&#125;;

int main() &#123;
   Base a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>子类对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   struct Base (primary base)
        0 |     (Base vtable pointer)
        8 |     int a
       12 |     int b
          | [sizeof&#x3D;16, dsize&#x3D;16, align&#x3D;8,
          |  nvsize&#x3D;16, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>依旧和上面相同，这个含有虚函数的结构体大小为16，在对象的头部，前8个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a占4个字节，b占4个字节，总大小为16。</li>
<li>子类虚函数表布局：</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
Vtable for &#39;Derive&#39; (5 entries).
  0 | offset_to_top (0)
  1 | Derive RTTI
      -- (Base, 0) vtable address --
      -- (Derive, 0) vtable address --
  2 | Derive::~Derive() [complete]
  3 | Derive::~Derive() [deleting]
  4 | void Derive::FuncB()<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li><img src="http://qiniu.orangew.cn/img/%E5%AD%90%E7%B1%BB%E8%99%9A%E5%87%BD%E6%95%B0%E8%A1%A8%E5%B8%83%E5%B1%80.jpg" alt="子类虚函数表布局"></li>
<li>注意这里虚函数表中的FuncB函数已经是Derive中的FuncB啦，因为在子类中重写了父类的这个函数。</li>
<li>再注意这里的RTTI中有了两项，表示Base和Derive的虚表地址是相同的，Base类里的虚函数和Derive类里的虚函数都在这个链条下，这里可以继续关注下面多继承的情况，看看有何不同。</li>
</ul>
<h3 id="多继承下不含有覆盖函数的类对象的布局"><a href="#多继承下不含有覆盖函数的类对象的布局" class="headerlink" title="多继承下不含有覆盖函数的类对象的布局"></a>多继承下不含有覆盖函数的类对象的布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">struct BaseA &#123;
   BaseA() &#x3D; default;
   virtual ~BaseA() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;BaseA FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct BaseB &#123;
   BaseB() &#x3D; default;
   virtual ~BaseB() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncC() &#123;
       printf(&quot;BaseB FuncC\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : public BaseA, public BaseB&#123;
&#125;;

int main() &#123;
   BaseA a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>类对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   struct BaseA (primary base)
        0 |     (BaseA vtable pointer)
        8 |     int a
       12 |     int b
       16 |   struct BaseB (base)
       16 |     (BaseB vtable pointer)
       24 |     int a
      28 |     int b
         | [sizeof&#x3D;32, dsize&#x3D;32, align&#x3D;8,
         |  nvsize&#x3D;32, nvalign&#x3D;8]<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>Derive大小为32，注意这里有了两个虚表指针，因为Derive是多继承，一般情况下继承了几个带有虚函数的类，对象布局中就有几个虚表指针，并且子类也会继承基类的数据，<strong>一般来说，不考虑内存对齐的话，子类（继承父类）的大小=子类（不继承父类）的大小+所有父类的大小</strong>。</li>
<li>虚函数表布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">Vtable for &#39;Derive&#39; (10 entries).
  0 | offset_to_top (0)
  1 | Derive RTTI
      -- (BaseA, 0) vtable address --
      -- (Derive, 0) vtable address --
  2 | Derive::~Derive() [complete]
  3 | Derive::~Derive() [deleting]
  4 | void BaseA::FuncB()
  5 | offset_to_top (-16)
  6 | Derive RTTI
      -- (BaseB, 16) vtable address --
  7 | Derive::~Derive() [complete]
      [this adjustment: -16 non-virtual]
  8 | Derive::~Derive() [deleting]
      [this adjustment: -16 non-virtual]
  9 | void BaseB::FuncC()<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局图</li>
<li><img src="http://qiniu.orangew.cn/img/%E5%A4%9A%E7%BB%A7%E6%89%BF%E5%AF%B9%E8%B1%A1%E5%B8%83%E5%B1%80%E5%9B%BE.png" alt="多继承对象布局图"></li>
<li>**offset_to_top(0)**：表示当前这个虚函数表（BaseA，Derive）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为0。</li>
<li>再注意这里的<strong>RTTI</strong>中有了两项，表示BaseA和Derive的虚表地址是相同的，BaseA类里的虚函数和Derive类里的虚函数都在这个链条下，截至到offset_to_top(-16)之前都是BaseA和Derive的虚函数表。</li>
<li>**offset_to_top(-16)**：表示当前这个虚函数表（BaseB）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为-16，这里用于this指针偏移，下一小节会介绍。</li>
<li>注意下后面的这个RTTI：只有一项，表示BaseB的虚函数表，后面也有两个虚析构函数，为什么有四个Derive类的析构函数呢，又是怎么调用呢，请继续往下看~</li>
</ul>
<h3 id="多继承下含有覆盖函数的类对象的布局"><a href="#多继承下含有覆盖函数的类对象的布局" class="headerlink" title="多继承下含有覆盖函数的类对象的布局"></a>多继承下含有覆盖函数的类对象的布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
struct BaseA &#123;
   BaseA() &#x3D; default;
   virtual ~BaseA() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;BaseA FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct BaseB &#123;
   BaseB() &#x3D; default;
   virtual ~BaseB() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncC() &#123;
       printf(&quot;BaseB FuncC\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : public BaseA, public BaseB&#123;
   void FuncB() override &#123;
       printf(&quot;Derive FuncB \n&quot;);
  &#125;

   void FuncC() override &#123;
       printf(&quot;Derive FuncC \n&quot;);
  &#125;
&#125;;

int main() &#123;
   BaseA a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">*** Dumping AST Record Layout
        0 | struct Derive
        0 |   struct BaseA (primary base)
        0 |     (BaseA vtable pointer)
        8 |     int a
       12 |     int b
       16 |   struct BaseB (base)
       16 |     (BaseB vtable pointer)
       24 |     int a
       28 |     int b
          | [sizeof&#x3D;32, dsize&#x3D;32, align&#x3D;8,
          |  nvsize&#x3D;32, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>类大小仍然是32，和上面一样。</li>
<li>虚函数表布局：</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">Vtable for &#39;Derive&#39; (11 entries).
  0 | offset_to_top (0)
  1 | Derive RTTI
      -- (BaseA, 0) vtable address --
      -- (Derive, 0) vtable address --
  2 | Derive::~Derive() [complete]
  3 | Derive::~Derive() [deleting]
  4 | void Derive::FuncB()
  5 | void Derive::FuncC()
  6 | offset_to_top (-16)
  7 | Derive RTTI
      -- (BaseB, 16) vtable address --
  8 | Derive::~Derive() [complete]
      [this adjustment: -16 non-virtual]
  9 | Derive::~Derive() [deleting]
      [this adjustment: -16 non-virtual]
 10 | void Derive::FuncC()
      [this adjustment: -16 non-virtual]<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li><img src="http://qiniu.orangew.cn/img/%E5%A4%9A%E7%BB%A7%E6%89%BF%E8%A6%86%E7%9B%96%E8%99%9A%E5%87%BD%E6%95%B0%E5%B8%83%E5%B1%80.jpg" alt="多继承覆盖虚函数布局"></li>
<li>**offset_to_top(0)**：表示当前这个虚函数表（BaseA，Derive）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为0。</li>
<li>再注意这里的<strong>RTTI</strong>中有了两项，表示BaseA和Derive的虚表地址是相同的，BaseA类里的虚函数和Derive类里的虚函数都在这个链条下，截至到**offset_to_top(-16)**之前都是BaseA和Derive的虚函数表。</li>
<li>**offset_to_top(-16)<strong>：表示当前这个虚函数表（BaseB）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为-16。当基类BaseB的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncC()时候，由于FuncC()已经被重写，而此时的this指针指向的是BaseB类型的对象，需要对this指针进行调整，就是</strong>offset_to_top(-16)**，所以this指针向上调整了16字节，之后调用FuncC()，就调用到了被重写后Derive虚函数表中的FuncC()函数。这些带adjustment标记的函数都是需要进行指针调整的。至于上面所说的这里虚函数是怎么调用的，估计您也明白了吧~</li>
</ul>
<h3 id="多重继承不同的继承顺序导致的类对象的布局相同吗？"><a href="#多重继承不同的继承顺序导致的类对象的布局相同吗？" class="headerlink" title="多重继承不同的继承顺序导致的类对象的布局相同吗？"></a>多重继承不同的继承顺序导致的类对象的布局相同吗？</h3><ul>
<li>对象布局和上面的不相同啦，BaseB的虚函数表指针和数据在上面，BaseA的虚函数表指针和数据在下面，以A，B的顺序继承，对象的布局就是A在上B在下，以B，A的顺序继承，对象的布局就是B在上A在下。</li>
<li><img src="http://qiniu.orangew.cn/img/%E4%B8%8D%E5%90%8C%E7%BB%A7%E6%89%BF%E9%A1%BA%E5%BA%8F.png" alt="不同继承顺序"></li>
</ul>
<h3 id="虚继承的布局"><a href="#虚继承的布局" class="headerlink" title="虚继承的布局"></a>虚继承的布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
struct Base &#123;
   Base() &#x3D; default;
   virtual ~Base() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;BaseA FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : virtual public Base&#123;
   void FuncB() override &#123;
       printf(&quot;Derive FuncB \n&quot;);
  &#125;
&#125;;

int main() &#123;
   Base a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   (Derive vtable pointer)
        8 |   struct Base (virtual base)
        8 |     (Base vtable pointer)
       16 |     int a
       20 |     int b
          | [sizeof&#x3D;24, dsize&#x3D;24, align&#x3D;8,
          |  nvsize&#x3D;8, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>虚继承下，这里的对象布局和普通单继承有所不同，普通单继承下子类和基类共用一个虚表地址，而在虚继承下，子类和虚基类分别有一个虚表地址的指针，两个指针大小总和为16，再加上a和b的大小8，为24。</li>
<li>虚函数表：</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
Vtable for &#39;Derive&#39; (13 entries).
  0 | vbase_offset (8)
  1 | offset_to_top (0)
  2 | Derive RTTI
      -- (Derive, 0) vtable address --
  3 | void Derive::FuncB()
  4 | Derive::~Derive() [complete]
  5 | Derive::~Derive() [deleting]
  6 | vcall_offset (-8)
  7 | vcall_offset (-8)
  8 | offset_to_top (-8)
  9 | Derive RTTI
      -- (Base, 8) vtable address --
 10 | Derive::~Derive() [complete]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 11 | Derive::~Derive() [deleting]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 12 | void Derive::FuncB()
      [this adjustment: 0 non-virtual, -32 vcall offset offset]<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局图</li>
<li><img src="http://qiniu.orangew.cn/img/%E8%99%9A%E7%BB%A7%E6%89%BF.png" alt="虚继承"></li>
<li>**vbase_offset(8)**：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量</li>
<li><strong>vcall_offset(-8)<strong>：当</strong>虚基类</strong>Base的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncB()时候，由于FuncB()已经被重写，而此时的this指针指向的是Base类型的对象，需要对this指针进行调整，就是vcall_offset(-8)，所以this指针向上调整了8字节，之后调用FuncB()，就调用到了被重写后的FuncB()函数。</li>
</ul>
<h3 id="虚继承带未覆盖函数的对象布局"><a href="#虚继承带未覆盖函数的对象布局" class="headerlink" title="虚继承带未覆盖函数的对象布局"></a>虚继承带未覆盖函数的对象布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">struct Base &#123;
   Base() &#x3D; default;
   virtual ~Base() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;Base FuncB\n&quot;);
  &#125;

   virtual void FuncC() &#123;
       printf(&quot;Base FuncC\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : virtual public Base&#123;
   void FuncB() override &#123;
       printf(&quot;Derive FuncB \n&quot;);
  &#125;
&#125;;

int main() &#123;
   Base a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   (Derive vtable pointer)
        8 |   struct Base (virtual base)
        8 |     (Base vtable pointer)
       16 |     int a
       20 |     int b
          | [sizeof&#x3D;24, dsize&#x3D;24, align&#x3D;8,
          |  nvsize&#x3D;8, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>和上面虚继承情况下相同，普通单继承下子类和基类共用一个虚表地址，而在虚继承下，子类和虚基类分别有一个虚表地址的指针，两个指针大小总和为16，再加上a和b的大小8，为24。</li>
<li>虚函数表布局：</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">Vtable for &#39;Derive&#39; (15 entries).
  0 | vbase_offset (8)
  1 | offset_to_top (0)
  2 | Derive RTTI
      -- (Derive, 0) vtable address --
  3 | void Derive::FuncB()
  4 | Derive::~Derive() [complete]
  5 | Derive::~Derive() [deleting]
  6 | vcall_offset (0)
  7 | vcall_offset (-8)
  8 | vcall_offset (-8)
  9 | offset_to_top (-8)
 10 | Derive RTTI
      -- (Base, 8) vtable address --
 11 | Derive::~Derive() [complete]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 12 | Derive::~Derive() [deleting]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 13 | void Derive::FuncB()
      [this adjustment: 0 non-virtual, -32 vcall offset offset]
 14 | void Base::FuncC()<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>对象布局图</li>
<li><img src="http://qiniu.orangew.cn/img/%E8%99%9A%E7%BB%A7%E6%89%BF%E6%9C%AA%E8%A6%86%E7%9B%96.png" alt="虚继承未覆盖"></li>
<li>**vbase_offset(8)**：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量</li>
<li><strong>vcall_offset(-8)<strong>：当</strong>虚基类</strong>Base的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncB()时候，由于FuncB()已经被重写，而此时的this指针指向的是Base类型的对象，需要对this指针进行调整，就是vcall_offset(-8)，所以this指针向上调整了8字节，之后调用FuncB()，就调用到了被重写后的FuncB()函数</li>
<li>**vcall_offset(0)**：当Base的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncC()时候，由于FuncC()没有被重写，所以不需要对this指针进行调整，就是vcall_offset(0)，之后调用FuncC()。</li>
</ul>
<h3 id="菱形继承下类对象的布局"><a href="#菱形继承下类对象的布局" class="headerlink" title="菱形继承下类对象的布局"></a>菱形继承下类对象的布局</h3><pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
struct Base &#123;
   Base() &#x3D; default;
   virtual ~Base() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;BaseA FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct BaseA : virtual public Base &#123;
   BaseA() &#x3D; default;
   virtual ~BaseA() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncB() &#123;
       printf(&quot;BaseA FuncB\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct BaseB : virtual public Base &#123;
   BaseB() &#x3D; default;
   virtual ~BaseB() &#x3D; default;
   
   void FuncA() &#123;&#125;

   virtual void FuncC() &#123;
       printf(&quot;BaseB FuncC\n&quot;);
  &#125;

   int a;
   int b;
&#125;;

struct Derive : public BaseB, public BaseA&#123;
   void FuncB() override &#123;
       printf(&quot;Derive FuncB \n&quot;);
  &#125;

   void FuncC() override &#123;
       printf(&quot;Derive FuncC \n&quot;);
  &#125;
&#125;;

int main() &#123;
   BaseA a;
   Derive d;
   return 0;
&#125;<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>类对象布局</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">
*** Dumping AST Record Layout
        0 | struct Derive
        0 |   struct BaseB (primary base)
        0 |     (BaseB vtable pointer)
        8 |     int a
       12 |     int b
       16 |   struct BaseA (base)
       16 |     (BaseA vtable pointer)
       24 |     int a
       28 |     int b
       32 |   struct Base (virtual base)
       32 |     (Base vtable pointer)
       40 |     int a
       44 |     int b
          | [sizeof&#x3D;48, dsize&#x3D;48, align&#x3D;8,
          |  nvsize&#x3D;32, nvalign&#x3D;8]

*** Dumping IRgen Record Layout<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<ul>
<li>大小为48，这里不用做过多介绍啦，相信您已经知道了吧。</li>
<li>虚函数表</li>
</ul>
<pre class="line-numbers language-c++" data-language="c++"><code class="language-c++">table for &#39;Derive&#39; (20 entries).
  0 | vbase_offset (32)
  1 | offset_to_top (0)
  2 | Derive RTTI
      -- (BaseB, 0) vtable address --
      -- (Derive, 0) vtable address --
  3 | Derive::~Derive() [complete]
  4 | Derive::~Derive() [deleting]
  5 | void Derive::FuncC()
  6 | void Derive::FuncB()
  7 | vbase_offset (16)
  8 | offset_to_top (-16)
  9 | Derive RTTI
      -- (BaseA, 16) vtable address --
 10 | Derive::~Derive() [complete]
      [this adjustment: -16 non-virtual]
 11 | Derive::~Derive() [deleting]
      [this adjustment: -16 non-virtual]
 12 | void Derive::FuncB()
      [this adjustment: -16 non-virtual]
 13 | vcall_offset (-32)
 14 | vcall_offset (-32)
 15 | offset_to_top (-32)
 16 | Derive RTTI
      -- (Base, 32) vtable address --
 17 | Derive::~Derive() [complete]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 18 | Derive::~Derive() [deleting]
      [this adjustment: 0 non-virtual, -24 vcall offset offset]
 19 | void Derive::FuncB()
      [this adjustment: 0 non-virtual, -32 vcall offset offset]<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>

<p><img src="http://qiniu.orangew.cn/img/%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E5%AF%B9%E8%B1%A1%E5%B8%83%E5%B1%80%E5%9B%BE.png" alt="菱形继承对象布局图"></p>
<ul>
